# Яндекс Умный дом
# структура - "команда после триггера включи или выключи": "ID устройства"
YANDEX_DEVICE_IDS = {
    "свет в комнате": "3193e021-ce11-41f6-aa10-779a688ace42",      # свет в комнате
    "кулер": "01bf4270-e182-4725-bf47-16c0b7811585",     # розетка кулера
    "свет в кухни": "fb256f9a-304f-4848-b0ab-e045239759db", # свет на кухне
    "свет в ванной": "187d7c73-d101-4f09-a533-9a23bab2ca37",     # свет в ванне
    "свет в коридоре": "5abee79a-f38f-4fbf-a599-3815fab9895e",   # свет в коридоре
    "гирлянда": "d4485a12-d62e-4056-809c-7cdc86a91723",  # гирлянда
    "проектор": "d36ecbe7-1fdb-44cb-b953-ed9ddd28e2d3",  # проектор
}


# Команды для активации
OLEG_COMMANDS = ["Олег", "Олежа", "Олежка"]


# Типы команд
CURRENCY = ["курс", "доллар", "евро"]


# Форматы времени
MINUTE_FORMATS = ["минут", "минуты", "минуту", "минута"]
HOUR_FORMATS = ["часов", "часа", "час"]
UTC_OFFSET = 7
DEFAULT_CITY = "кемерово"


# Курсы валют
CURRENCY_NAMES = {
    "доллара": "USD",
    "евро": "EUR",
}


WORD_CURRENCY = {
    "доллар": "USD",
    "евро": "EUR",
}
